In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/028.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

         0    1    2                       3                   4
0      NaN  NaN  NaN  Burns, Jr. (R)  70,787  Barrow (D)  71,651
1      NaN  NaN  NaN                   49.7%               50.3%
2   County   PR   TP                     NaN                 NaN
3  BALDWIN   15   15                    3920                4530
4  BULLOCH   18   18                    8228                4400

In [5]:
df = df[3:]

In [6]:
df.head(5)

         0   1   2      3      4
3  BALDWIN  15  15   3920   4530
4  BULLOCH  18  18   8228   4400
5    BURKE  17  17   2709   2430
6  CANDLER   4   4   1288    745
7  CHATHAM  73  73  12660  20267

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

         0      3      4
3  BALDWIN   3920   4530
4  BULLOCH   8228   4400
5    BURKE   2709   2430
6  CANDLER   1288    745
7  CHATHAM  12660  20267

In [9]:
df.columns = ['county', 'Max Burns', 'John Barrow']

In [10]:
df.tail(5)

        county Max Burns John Barrow
20    TATTNALL      2852        1438
21      TOOMBS      3883        2270
22    TREUTLEN       753         716
23      WARREN       729         804
24  WASHINGTON      2431        2809

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

    county  candidate  votes
0  BALDWIN  Max Burns   3920
1  BULLOCH  Max Burns   8228
2    BURKE  Max Burns   2709
3  CANDLER  Max Burns   1288
4  CHATHAM  Max Burns  12660

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 3 columns):
county       44 non-null object
candidate    44 non-null object
votes        44 non-null int64
dtypes: int64(1), object(2)
memory usage: 1.1+ KB

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '12'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Max Burns', 'party'] = 'Republican'
df.loc[df['candidate'] == 'John Barrow', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate    party
John Barrow  Democrat      71651
Max Burns    Republican    70787
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district       party  candidate  votes
0  BALDWIN  U.S. Representative       12  Republican  Max Burns   3920
1  BULLOCH  U.S. Representative       12  Republican  Max Burns   8228
2    BURKE  U.S. Representative       12  Republican  Max Burns   2709
3  CANDLER  U.S. Representative       12  Republican  Max Burns   1288
4  CHATHAM  U.S. Representative       12  Republican  Max Burns  12660

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')